export default class player{
    constructor(x,y){
        this.x=x;
        this.y=y;
    }
    draw(){
        translate(this.x, this.y+300);
        scale(0.4);
        noStroke();
        fill(118, 118, 118);
        //head
        triangle(-20, -80, 0, -130, 20, -80);
        //body
        fill(112, 112, 112);
        quad(-20, -80, -20, 50, 20, 50, 20, -80);
        //
        fill(118, 118, 118);
        quad(-10, -80, -10, 50, 10, 50, 10, -80);
        //左引擎
        fill(100, 100, 100);
        quad(-65, 50, -65, 35, -40, 25, -40, 50);
        //左翅膀
        fill(118, 118, 118);
        quad(-20, -50, -130, 35, -100, 53, -20, 20);
        //左翅膀上面的
        fill(108, 108, 110);
        quad(-115, 44, -100, 53, -20, 20, -20, -25);
        //右引擎
        fill(100, 100, 100);
        quad(40, 50, 65, 50, 65, 30, 40, 25);
        //右翅膀
        fill(118, 118, 118);
        quad(20, -50, 130, 35, 100, 53, 20, 20);
        //右翅膀上面的
        fill(108, 108, 110);
        quad(20, -25, 20, 20, 100, 53, 115, 44);
        //尾巴
        fill(118, 118, 118);
        quad(-10, 90, -10, 50, 10, 50, 10, 90);
        //左尾翼
        fill(118, 118, 118);
        quad(-55, 75, -45, 90, -10, 85, -10, 55);
        //左尾翼上面的
        fill(108, 108, 110);
        quad(-50, 82, -45, 90, -10, 85, -10, 65);
        //右尾翼
        fill(118, 118, 118);
        quad(10, 55, 10, 85, 45, 90, 55, 75);
        //右尾翼上面的
        fill(108, 108, 110);
        quad(10, 65, 10, 85, 45, 90, 50, 82);
        
    }
    move() {
        // Fighter move
        if (keyIsDown(65)&&this.x>50||keyIsDown(37)&&this.x>50) {
            this.x-=5;
        }
        
        else if (keyIsDown(68)&&this.x<550||keyIsDown(39)&&this.x<550) {

            this.x+=5;

        }

    }
    
}
    